data/outputs/nginx/test2.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        192.168.1.133
Server Port:            80

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   4.384 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      464000 bytes
HTML transferred:       223000 bytes
Requests per second:    228.09 [#/sec] (mean)
Time per request:       219.212 [ms] (mean)
Time per request:       4.384 [ms] (mean, across all concurrent requests)
Transfer rate:          103.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  33.8      0    1055
Processing:     0  211 237.5    159    1290
Waiting:        0   86  71.0     80    1261
Total:         16  215 239.7    162    1290

Percentage of the requests served within a certain time (ms)
  50%    162
  66%    174
  75%    178
  80%    184
  90%    191
  95%   1226
  98%   1260
  99%   1261
 100%   1290 (longest request)