data/outputs/nginx/test3.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        192.168.1.133
Server Port:            80

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.381 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      464000 bytes
HTML transferred:       223000 bytes
Requests per second:    295.81 [#/sec] (mean)
Time per request:       169.025 [ms] (mean)
Time per request:       3.381 [ms] (mean, across all concurrent requests)
Transfer rate:          134.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   6.1      0      41
Processing:     0  162  32.8    159     252
Waiting:        0   94  50.9     94     245
Total:          0  165  33.2    162     261

Percentage of the requests served within a certain time (ms)
  50%    162
  66%    172
  75%    179
  80%    187
  90%    203
  95%    219
  98%    245
  99%    245
 100%    261 (longest request)