data/outputs/nginx/test5.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        192.168.1.133
Server Port:            80

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.150 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      464000 bytes
HTML transferred:       223000 bytes
Requests per second:    317.51 [#/sec] (mean)
Time per request:       157.477 [ms] (mean)
Time per request:       3.150 [ms] (mean, across all concurrent requests)
Transfer rate:          143.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.8      0      47
Processing:     0  151  23.3    155     205
Waiting:        0   79  45.6     78     183
Total:          0  154  23.2    156     205

Percentage of the requests served within a certain time (ms)
  50%    156
  66%    160
  75%    162
  80%    166
  90%    177
  95%    184
  98%    200
  99%    200
 100%    205 (longest request)