data/outputs/nginx/test7.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        192.168.1.133
Server Port:            80

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.354 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      464000 bytes
HTML transferred:       223000 bytes
Requests per second:    298.14 [#/sec] (mean)
Time per request:       167.704 [ms] (mean)
Time per request:       3.354 [ms] (mean, across all concurrent requests)
Transfer rate:          135.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.8      0      31
Processing:     0  159  30.1    159     240
Waiting:        0   98  48.9     96     206
Total:          0  162  30.3    162     242

Percentage of the requests served within a certain time (ms)
  50%    162
  66%    173
  75%    179
  80%    184
  90%    192
  95%    203
  98%    219
  99%    234
 100%    242 (longest request)