data/outputs/nginx/test8.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        192.168.1.133
Server Port:            80

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.213 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      464000 bytes
HTML transferred:       223000 bytes
Requests per second:    311.25 [#/sec] (mean)
Time per request:       160.640 [ms] (mean)
Time per request:       3.213 [ms] (mean, across all concurrent requests)
Transfer rate:          141.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.6      0      31
Processing:     0  153  28.4    156     204
Waiting:        0   86  46.9     83     184
Total:          0  156  28.6    159     204

Percentage of the requests served within a certain time (ms)
  50%    159
  66%    172
  75%    176
  80%    179
  90%    187
  95%    189
  98%    193
  99%    197
 100%    204 (longest request)