data/outputs/nginx/test9.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        nginx/1.24.0
Server Hostname:        192.168.1.133
Server Port:            80

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.293 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      464000 bytes
HTML transferred:       223000 bytes
Requests per second:    303.63 [#/sec] (mean)
Time per request:       164.672 [ms] (mean)
Time per request:       3.293 [ms] (mean, across all concurrent requests)
Transfer rate:          137.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   6.1      0      47
Processing:     0  157  27.9    157     208
Waiting:        0   83  49.0     81     208
Total:          0  161  27.9    160     213

Percentage of the requests served within a certain time (ms)
  50%    160
  66%    171
  75%    177
  80%    183
  90%    191
  95%    198
  98%    203
  99%    207
 100%    213 (longest request)